## Staging: hosted_zone
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |               NAME               |
|--------|----------------------------------|
| add    | `aws_route53_zone.ai_answers`    |
| delete | `aws_route53_zone.react_answers` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  - destroy
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route53_zone.ai_answers will be created
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route53_zone" "ai_answers" {
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                 = (known after apply)
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + comment             = "Managed by Terraform"
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_destroy       = false
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                  = (known after apply)
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                = "ai-answers.cdssandbox.xyz"
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_servers        = (known after apply)
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + primary_name_server = (known after apply)
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                = {
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all            = {
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:14.094[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + zone_id             = (known after apply)
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route53_zone.react_answers will be destroyed
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # (because aws_route53_zone.react_answers is not in configuration)
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  - resource "aws_route53_zone" "react_answers" {
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - arn                 = "arn:aws:route53:::hostedzone/Z0773939395KMX9TWPRGG" -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - comment             = "Managed by Terraform" -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - force_destroy       = false -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - id                  = "Z0773939395KMX9TWPRGG" -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - name                = "react-answers.cdssandbox.xyz" -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - name_servers        = [
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "ns-1246.awsdns-27.org",
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "ns-1779.awsdns-30.co.uk",
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "ns-204.awsdns-25.com",
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "ns-884.awsdns-46.net",
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ] -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - primary_name_server = "ns-1246.awsdns-27.org" -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - tags                = {
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "CostCentre" = "react-answers-staging"
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "Terraform"  = "true"
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        } -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - tags_all            = {
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "CostCentre" = "react-answers-staging"
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "Terraform"  = "true"
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        } -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - zone_id             = "Z0773939395KMX9TWPRGG" -> null
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged attribute hidden)
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 1 to add, 0 to change, 1 to destroy.
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ hosted_zone_id = "Z0773939395KMX9TWPRGG" -> (known after apply)
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m13:33:14.095[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
